zuorasoap/zuorasoap-connector/zuorasoap-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/zuorasoap/esbQueryMoreMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.zuora">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
        <urn:username>%s(username)</urn:username>
        <urn:password>%s(password)</urn:password>
        <urn:method>queryMore</urn:method>
        <urn:queryLocator>%s(queryLocator)</urn:queryLocator>
        <urn:batchSize>%s(batchSize)</urn:batchSize>
    </soapenv:Body>
</soapenv:Envelope>